const STATUS_MAP = {

  // common mapping 

  स्वीकृत: "APPROVED",
  अस्वीकृत: "REJECTED",
  समाप्त: "FINISHED",

  //  complaints
  'पंजीकृत': "PS Registration",
  'पूछताछअधिकारीनिरुपित': "PS Inquiry Officer Assigned",
  'पूछताछरिपोर्टसमर्पित': "PS Inquiry Report Submitted ",
  'प्रतिबंधात्मककार्यवाही': "PS For Initial Registration",
  'शासकीयजांच': "PS Departmental Inquiry",
  'लघुशास्ति(बिनाशासकीयजांच)': "PS Minor Punishment (Without Departmental Inquiry)",
  'प्राथमिकपंजीकृतहोनेकेलिए': "PS For Initial Registration",


  //  Postmortem
'प्रक्रियाकेतहत':"UnderProcess",



  "(पूछताछअधिकारीनिरुपित/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
  "(पूछताछअधिकारीनिरुपित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/LIU/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/LIU/DCP",
  "(पूछताछअधिकारीनिरुपित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/LIU/DCP",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "DCRB/DCP",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/अस्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "PS/DCRB",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "PS/DCRB/LIU",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "DCRB/LIU/DCP",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/अस्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/LIU/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "PS",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/अस्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "REJECTED",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "APPROVED",
  "(पूछताछअधिकारीनिरुपित/अस्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/LIU/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCRB/LIU/DCP",
  "(पूछताछअधिकारीनिरुपित/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)": "PS",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "LIU/DCP",
  "(पूछताछअधिकारीनिरुपित/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/LIU/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/स्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "PS",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "DCRB",
  "(पूछताछअधिकारीनिरुपित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)":
    "PS/DCRB",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "PS/LIU",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "DCRB/LIU",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "LIU",
  "(पूछताछअधिकारीनिरुपित/जमाकरनेकेलिएलंबितडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "PS/DCRB/LIU",
  "(पूछताछअधिकारीनिरुपित/स्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "PS/LIU",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/अस्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)":
    "LIU",
  "(पूछताछअधिकारीनिरुपित/अस्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/LIU/DCP",
  "(पुलिसस्टेशनद्वारासत्यापनपूर्णकियागया/अस्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "LIU/DCP",
  "(पूछताछअधिकारीसमनुदेशनकेलिएलंबित/अस्वीकृतडीसीआरबीद्वारा/जमाकरनेकेलिएलंबितएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/LIU/DCP",
  "(पूछताछअधिकारीद्वाराप्रस्तुतसत्यापनरिपोर्ट/अस्वीकृतडीसीआरबीद्वारा/स्वीकृतएलआईयूद्वारा)-औरएस.पी./एस.एस.पी.सेलंबितकार्यवाही":
    "PS/DCP",
};
module.exports = { STATUS_MAP };
